{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "Medium_network_deconvs", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "InputLayer"}, "name": "InputLayer", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1", "inbound_nodes": [[["InputLayer", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_5", "inbound_nodes": [[["Conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_6", "inbound_nodes": [[["Conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv3", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_7", "inbound_nodes": [[["Conv3", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Deconv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Deconv1", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_8", "inbound_nodes": [[["Deconv1", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Deconv2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Deconv2", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_9", "inbound_nodes": [[["Deconv2", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Deconv3", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Deconv3", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.tanh_1", "trainable": true, "dtype": "float32", "function": "math.tanh"}, "name": "tf.math.tanh_1", "inbound_nodes": [["Deconv3", 0, 0, {"name": null}]]}], "input_layers": [["InputLayer", 0, 0]], "output_layers": [["tf.math.tanh_1", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Conv1/kernel", "shape": [9, 9, 3, 32], "dtype": "float32"}, {"name": "Conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "Conv2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "Conv2/bias", "shape": [64], "dtype": "float32"}, {"name": "Conv3/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "Conv3/bias", "shape": [128], "dtype": "float32"}, {"name": "Deconv1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "Deconv1/bias", "shape": [64], "dtype": "float32"}, {"name": "Deconv2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "Deconv2/bias", "shape": [32], "dtype": "float32"}, {"name": "Deconv3/kernel", "shape": [9, 9, 3, 32], "dtype": "float32"}, {"name": "Deconv3/bias", "shape": [3], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_8/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_9/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_9/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_9/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_9/moving_variance", "shape": [32], "dtype": "float32"}]}]}